<template>
	<div id="app">
		<b-modal v-model="modal.modalShow" hide-footer size="xl" :title="modal.modalTitle">
			<b-row>
				<b-col cols="12" sm="12" md="12" lg="4"><img :src="modal.modalImg" alt=""></b-col>
				<b-col cols="12" sm="12" md="12" lg="8"><p v-html="modal.modalContent"></p></b-col>
			</b-row>
		</b-modal>
		<b-modal v-model="modalPolitics.modalShow" hide-footer size="xl" :title="modalPolitics.title">
			<b-row>
				<b-col cols="12">
					<h3>1. Общие положения</h3>
					<p>Настоящая политика обработки персональных данных составлена в соответствии с требованиями Федерального закона от 27.07.2006. №152-ФЗ «О персональных данных» и определяет порядок обработки персональных данных и меры по обеспечению безопасности персональных данных, предпринимаемые Михайловым Иваном Сергеевичем (далее – Оператор).</p>
					<ul>
						<li>1.1. Оператор ставит своей важнейшей целью и условием осуществления своей деятельности соблюдение прав и свобод человека и гражданина при обработке его персональных данных, в том числе защиты прав на неприкосновенность частной жизни, личную и семейную тайну.</li>
						<li>1.2. Настоящая политика Оператора в отношении обработки персональных данных (далее – Политика) применяется ко всей информации, которую Оператор может получить о посетителях веб-сайта httpsː//thismywebsite·com.</li>
					</ul>
					<h3>2. Основные понятия, используемые в Политике</h3>
					<ul>
						<li>2.1. Автоматизированная обработка персональных данных – обработка персональных данных с помощью средств вычислительной техники;</li>
						<li>2.2. Блокирование персональных данных – временное прекращение обработки персональных данных (за исключением случаев, если обработка необходима для уточнения персональных данных);</li>
						<li>2.3. Веб-сайт – совокупность графических и информационных материалов, а также программ для ЭВМ и баз данных, обеспечивающих их доступность в сети интернет по сетевому адресу httpsː//thismywebsite·com;</li>
						<li>2.4. Информационная система персональных данных — совокупность содержащихся в базах данных персональных данных, и обеспечивающих их обработку информационных технологий и технических средств;</li>
						<li>2.5. Обезличивание персональных данных — действия, в результате которых невозможно определить без использования дополнительной информации принадлежность персональных данных конкретному Пользователю или иному субъекту персональных данных;</li>
						<li>2.6. Обработка персональных данных – любое действие (операция) или совокупность действий (операций), совершаемых с использованием средств автоматизации или без использования таких средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных;</li>
						<li>2.7. Оператор – государственный орган, муниципальный орган, юридическое или физическое лицо, самостоятельно или совместно с другими лицами организующие и (или) осуществляющие обработку персональных данных, а также определяющие цели обработки персональных данных, состав персональных данных, подлежащих обработке, действия (операции), совершаемые с персональными данными;</li>
						<li>2.8. Персональные данные – любая информация, относящаяся прямо или косвенно к определенному или определяемому Пользователю веб-сайта httpsː//thismywebsite·com;</li>
						<li>2.9. Пользователь – любой посетитель веб-сайта httpsː//thismywebsite·com;</li>
						<li>2.10. Предоставление персональных данных – действия, направленные на раскрытие персональных данных определенному лицу или определенному кругу лиц;</li>
						<li>2.11. Распространение персональных данных – любые действия, направленные на раскрытие персональных данных неопределенному кругу лиц (передача персональных данных) или на ознакомление с персональными данными неограниченного круга лиц, в том числе обнародование персональных данных в средствах массовой информации, размещение в информационно-телекоммуникационных сетях или предоставление доступа к персональным данным каким-либо иным способом;</li>
						<li>2.12. Трансграничная передача персональных данных – передача персональных данных на территорию иностранного государства органу власти иностранного государства, иностранному физическому или иностранному юридическому лицу;</li>
						<li>2.13. Уничтожение персональных данных – любые действия, в результате которых персональные данные уничтожаются безвозвратно с невозможностью дальнейшего восстановления содержания персональных данных в информационной системе персональных данных и (или) уничтожаются материальные носители персональных данных.</li>
					</ul>
					<h3>3. Оператор может обрабатывать следующие персональные данные Пользователя</h3>
					<ul>
						<li>3.1. Фамилия, имя, отчество;</li>
						<li>3.2. Номер телефона;</li>
						<li>3.3. Адрес электронной почты;</li>
						<li>3.4. Также на сайте происходит сбор и обработка обезличенных данных о посетителях (в т.ч. файлов «cookie») с помощью сервисов интернет-статистики (Яндекс Метрика и Гугл Аналитика и других).</li>
						<li>3.5. Вышеперечисленные данные далее по тексту Политики объединены общим понятием Персональные данные.</li>
					</ul>
					<h3>4. Цели обработки персональных данных</h3>
					<ul>
						<li>4.1. Цель обработки персональных данных Пользователя — заключение, исполнение и прекращение гражданско-правовых договоров; предоставление доступа Пользователю к сервисам, информации и/или материалам, содержащимся на веб-сайте httpsː//thismywebsite·com; уточнение деталей заказа.</li>
						<li>4.2. Также Оператор имеет право направлять Пользователю уведомления о новых продуктах и услугах, специальных предложениях и различных событиях. Пользователь всегда может отказаться от получения информационных сообщений, направив Оператору письмо на адрес электронной почты privacy@thismywebsite·com с пометкой «Отказ от уведомлений о новых продуктах и услугах и специальных предложениях».</li>
						<li>4.3. Обезличенные данные Пользователей, собираемые с помощью сервисов интернет-статистики, служат для сбора информации о действиях Пользователей на сайте, улучшения качества сайта и его содержания.</li>
					</ul>
					<h3>5. Правовые основания обработки персональных данных</h3>
					<ul>
						<li>5.1. Оператор обрабатывает персональные данные Пользователя только в случае их заполнения и/или отправки Пользователем самостоятельно через специальные формы, расположенные на сайте httpsː//thismywebsite·com. Заполняя соответствующие формы и/или отправляя свои персональные данные Оператору, Пользователь выражает свое согласие с данной Политикой.</li>
						<li>5.2. Оператор обрабатывает обезличенные данные о Пользователе в случае, если это разрешено в настройках браузера Пользователя (включено сохранение файлов «cookie» и использование технологии JavaScript).</li>
					</ul>
					<h3>6. Порядок сбора, хранения, передачи и других видов обработки персональных данных</h3>
					<p>Безопасность персональных данных, которые обрабатываются Оператором, обеспечивается путем реализации правовых, организационных и технических мер, необходимых для выполнения в полном объеме требований действующего законодательства в области защиты персональных данных.</p>
					<ul>
						<li>6.1. Оператор обеспечивает сохранность персональных данных и принимает все возможные меры, исключающие доступ к персональным данным неуполномоченных лиц.</li>
						<li>6.2. Персональные данные Пользователя никогда, ни при каких условиях не будут переданы третьим лицам, за исключением случаев, связанных с исполнением действующего законодательства.</li>
						<li>6.3. В случае выявления неточностей в персональных данных, Пользователь может актуализировать их самостоятельно, путем направления Оператору уведомление на адрес электронной почты Оператора privacy@thismywebsite·com с пометкой «Актуализация персональных данных».</li>
						<li>6.4. Срок обработки персональных данных является неограниченным. Пользователь может в любой момент отозвать свое согласие на обработку персональных данных, направив Оператору уведомление посредством электронной почты на электронный адрес Оператора privacy@thismywebsite·com с пометкой «Отзыв согласия на обработку персональных данных».</li>
					</ul>
					<h3>7. Трансграничная передача персональных данных</h3>
					<ul>
						<li>7.1. Оператор до начала осуществления трансграничной передачи персональных данных обязан убедиться в том, что иностранным государством, на территорию которого предполагается осуществлять передачу персональных данных, обеспечивается надежная защита прав субъектов персональных данных.</li>
						<li>7.2. Трансграничная передача персональных данных на территории иностранных государств, не отвечающих вышеуказанным требованиям, может осуществляться только в случае наличия согласия в письменной форме субъекта персональных данных на трансграничную передачу его персональных данных и/или исполнения договора, стороной которого является субъект персональных данных.</li>
					</ul>
					<h3>8. Заключительные положения</h3>
					<ul>
						<li>8.1. Пользователь может получить любые разъяснения по интересующим вопросам, касающимся обработки его персональных данных, обратившись к Оператору с помощью электронной почты privacy@thismywebsite·com.</li>
						<li>8.2. В данном документе будут отражены любые изменения политики обработки персональных данных Оператором. Политика действует бессрочно до замены ее новой версией.</li>
						<li>8.3. Актуальная версия Политики в свободном доступе расположена в сети Интернет по адресу httpsː//thismywebsite·com/privacy/.</li>
					</ul>
				</b-col>
			</b-row>
		</b-modal>
		<main>
			<b-container fluid class="custom-container">
				<h1 class="main-header text-center">Реализованные проекты</h1>
				<p class="subtitle text-center">Коммуникационное агентство – часть многофункционального холдинга, объединяющего различные компании на территории России и ближнего зарубежья.</p>
				<p class="description text-center">Наши подходы к организации бизнеса и имеющиеся ресурсы позволяют одинаково эффективно обеспечивать реализацию как крупномасштабных федеральных или международных проектов, так и решать небольшие локальные задачи. Мы находимся в постоянном развитии, расширяя и укрепляя имеющиеся бизнес-направления, а также формируя новые</p>
				<b-row class="project">
					<b-col cols="12" md="12" lg="4" class="p-0" v-for="(item, index) in projects" :key="index" @click="openModal(item)">
						<div class="project_item">
							<img :src="item.img" alt="">
							<div class="project_item__overlay">
								<p>{{ item.title }}</p>
							</div>
						</div>
					</b-col>
					<b-col cols="12" md="12" lg="4" class="p-0" v-for="(item, index) in moreProjects" :key="'A'+ index" @click="openModal(item)">
						<div class="project_item" v-if="isMoreProjects">
							<img :src="item.img" alt="">
							<div class="project_item__overlay">
								<p>{{ item.title }}</p>
							</div>
						</div>
					</b-col>
				</b-row>
				<button class="custom-btn custom-btn__dark" @click="isMoreProjects = !isMoreProjects">{{moreProjectsBtnText}}</button>
			</b-container>
		</main>
		<footer>
			<b-container>
				<b-row>
					<b-col cols="12" md="12" lg="6" class="contacts-info">
						<p class="contacts-info__header">контакты</p>
						<p>Коммуникационное агентство</p>
						<p>344000, Россия, г. Ростов-на-Дону ул. Мира, д. 12 <br> Бизнес–центр «Рост», оф. 104</p>
						<b-row>
							<b-col cols="12" sm="12" md="12" lg="6" class="contacts-info__phone-block">
								<a href="tel:+78613001128">+7(861)300-11-28</a>
								<a href="tel:+78613001128">+7(861)300-11-28</a>
								<a href="tel:+78613001128">+7(861)300-11-28</a>
							</b-col>
							<b-col cols="12" sm="12" md="12" lg="6" class="contacts-info__email-block">
								<div class="contacts-info__separate"></div>
								<p>Email:</p>
								<a href="mailto:info@exemple.com">info@exemple.com</a>
								<a href="https://Facebook.com/exampleagency">Facebook.com/exampleagency</a>
							</b-col>
						</b-row>
					</b-col>
					<b-col cols="12" md="12" lg="6" class="contacts-form">
						<b-form @submit="onSubmit" class="form">
							<b-form-group id="input-group-1" label-for="input-1">
								<b-form-input
									id="input-1"
									v-model="form.name"
									required
									placeholder="Полное имя"
								></b-form-input>
							</b-form-group>
							<b-form-group id="input-group-2" label-for="input-2">
								<b-form-input
									id="input-2"
									v-model="form.email"
									type="email"
									required
									placeholder="E-mail"
								></b-form-input>
							</b-form-group>
							<b-form-group id="input-group-3" label-for="input-3">
								<b-form-input
									id="input-3"
									v-model="form.phone"
									required
									placeholder="Телефон"
								></b-form-input>
							</b-form-group>
							<b-form-group id="input-group-4" label-for="input-4">
								<b-form-textarea
									id="input-4"
									v-model="form.messege"
									placeholder="Пожалуйста, опишите задачу"
									rows="3"
									no-resize
									required
								></b-form-textarea>
							</b-form-group>
							<p class="politics" @click="openModalPolitics()">Политика обработки персональных данных</p>
							<button class="custom-btn custom-btn__light" type="submit" variant="primary">Отправить заявку</button>
						</b-form>
					</b-col>
				</b-row>
			</b-container>
		</footer>
	</div>
</template>
<script>
export default {
	data () {
		return {
			modal: {
				modalShow: false,
				modalTitle: '',
				modalImg: '',
				modalContent: ''
			},
			modalPolitics: {
				modalShow: false,
				title: "политика конфиденциальности"
			},
			form: {
				name: '',
				email: '',
				phone: '',
				messege: ''
			},
			projects:[
				{
					title: "республика саха",
					img: require('./assets/img/img_1.jpg'),
					description: '<p>Респу́блика Саха́ (Яку́тия) (якут. Саха Өрөспүүбүлүкэтэ, Саха Сирэ) — самый большой по площади субъект Российской Федерации, республика в её составе[7][8][9], а также самая большая административно-территориальная единица в мире. По размеру территории Якутия превосходит Аргентину — восьмое государство в мире по площади. Якутия также превосходит площадь Индии (если не брать в учёт спорную территорию Кашмир, тогда площадь Индии будет 3 065 027 км², а не 3 287 263 км²). Однако население республики меньше одного миллиона человек, что делает плотность населения в ней одной из самых низких в России (меньшую плотность имеют только Чукотский и Ненецкий автономные округа).</p><p>Входит в Дальневосточный федеральный округ, является частью Дальневосточного экономического района.Образована 27 апреля 1922 года как Якутская АССР в составе РСФСР, хотя Якутский уезд, близкий по территории современной Якутии, возник ещё в 1638 году. 27 сентября 1990 года Верховный Совет Якутской АССР объявил о преобразовании автономии в Якутскую-Саха Советскую Социалистическую Республику. В 1991 году Якутская-Саха ССР получила своё современное название — Республика Саха (Якутия).</p><p>Якутия — регион с высоким уровнем природно-ресурсного экономического потенциала[10].</p><p>Государственные языки: якутский и русский. В местах компактного проживания коренных малочисленных народов Севера, согласно Конституции республики, официальными являются языки этих народов. К ним могут относиться эвенкийский, эвенский, долганский и юкагирские языки, распространённые в Республике Саха.<p><p>Якутия — единственный субъект Российской Федерации, на территории которого применяется время трёх часовых поясов, разница с московским временем составляет +6, +7, +8 часов.</p>'
				},
				{
					title: "газпром",
					img: require('./assets/img/img_2.jpg'),
					description: '<p>ПАО «Газпро́м» — российская транснациональная энергетическая компания, более 50 % акций которой принадлежит государству. Является холдинговой компанией Группы «Газпром». Непосредственно ПАО «Газпром» осуществляет только продажу природного газа и сдаёт в аренду свою газотранспортную систему. Основные направления деятельности — геологоразведка, добыча, транспортировка, хранение, переработка и реализация газа, газового конденсата и нефти, реализация газа в качестве моторного топлива, а также производство и сбыт тепло- и электроэнергии[4].</p><p>Газпром является владельцем значительной части акций дочерней компании отрасли услуг электросвязи Газпром космические системы. Доля «Газпрома» в мировых запасах газа составляет 17 %, в российских — 72 %. На «Газпром» приходится 12 % мировой и 68 % российской добычи газа[4].</p><p>Занимает семнадцатое место в списке крупнейших энергетических компаний по версии S&P Global Platts[5] (2018). Компании принадлежит крупнейшая в мире газотранспортная система, протяжённость которой составляет 172,1 тыс. км[4].</p><p>«Газпром» — крупнейший в России производитель и экспортёр сжиженного природного газа (СПГ). Компания развивает действующий проект «Сахалин-2», а также реализует новые проекты в этой области[4]. На внутреннем рынке «Газпром» реализует свыше половины продаваемого газа. Кроме того, компания поставляет газ в более чем 30 стран ближнего и дальнего зарубежья[4]. До конца 2013 года «Газпром» обладал монопольным правом на экспорт любого газа из России. После декабря 2013 года за ним осталась монополия на экспорт трубопроводного газа[6][7].</p><p>Компания входит в четвёрку крупнейших российских производителей нефти. Суммарная установленная мощность электрогенерирующих активов «Газпрома» на территории России составляет около 16 % от общей установленной мощности российской энергосистемы. «Газпром» занимает первое место в мире по производству тепловой энергии[4].</p>'
				},
				{
					title: "nokia",
					img: require('./assets/img/img_3.jpg'),
					description: '<p>Nokia Corporation (фин. Nokia Oyj, произносится но́киа) — финская транснациональная компания, производитель телекоммуникационного оборудования для мобильных, фиксированных, широкополосных и IP-сетей. В 2000-е годы доминировала на мировом рынке мобильных телефонов (с 2013 года телефоны под маркой Nokia выпускаются другими производителями).</p><p>По состоянию на начало 2013 года в компании работало немногим менее 100 тыс. сотрудников, в конце 2000-х число сотрудников доходило до 132 тыс. человек[5].</p><p>Продукция компании продаётся более чем в 150 странах мира. В 2012 году утратила первое место на рынке мобильных телефонов, уступив первое место Samsung с долей 19 % против с 22 %[6].</p><p>В 2011—2012 годах в условиях утери доли рынка начала активно сотрудничать с Microsoft, по сути, отказавшись от поддержки своей собственной операционной системы для мобильных устройств Symbian и развития операционной системы MeeGo, перейдя на платформу Windows Phone; осенью 2013 года продала свой мобильный бизнес Microsoft за €5,44 млрд[7].</p><p>В апреле 2015 года был подписан договор о намерениях с Alcatel-Lucent, согласно которому эта компания будет приобретена за $15,6 млрд[⇨].</p><p>В мае 2016 года объявила о сотрудничестве независимой компанией HMD Global[8][9], начавшей производить телефоны и планшеты под брендом Nokia[10]. По состоянию на конец 2010-х годов одним из основных направлений деятельности стала разработка следующего поколения стандартов для сетей подвижной связи 5G и их тестирование на сетях действующих операторов связи.</p>'
				}
			],
			moreProjects: [
				{
					title: "Карелия",
					img: require('./assets/img/img_4.jpg'),
					description: '<p>Респу́блика Каре́лия (лив. карел. Karjalan tazavaldu, собств. карел. Karjalan tašavalta, фин. Karjalan tasavalta[8], вепс. Karjalan Tazovaldkund; краткие названия: Каре́лия[9], Ка́рьяла[9]) — субъект Российской Федерации, республика в её составе[10][11]. Входит в состав Северо-Западного федерального округа, является частью Северного экономического района.</p><p>Столица — город Петрозаводск[12].</p><p>Образована в 1920 году как Карельская трудовая коммуна[13], 25 июля 1923 г. преобразована в Автономную Карельскую Социалистическую Советскую Республику в составе РСФСР (с 5 декабря 1936 г. — Карельская Автономная Советская Социалистическая Республика). 31 марта 1940 г. постановлением Верховного совета СССР переименована в Карело-Финскую ССР и выведена из состава РСФСР.</p><p>С 16 июля 1956 г. — субъект в составе РСФСР.</p><p>9 августа 1990 г. Верховный совет республики принял Декларацию о государственном суверенитете, а 13 ноября 1991 года установил её современное название — Республика Карелия[14].</p><p>Западная граница Карелии совпадает с государственной границей Российской Федерации и Финляндии. На востоке Карелия граничит с Архангельской областью, на юге — с Вологодской и Ленинградской областями, на севере — с Мурманской областью.</p><p>Государственный язык — русский. Языки, пользующиеся государственной поддержкой в республике: карельский (не является одним из государственных языков республики ввиду отсутствия алфавита на кириллической основе), финский и вепсский.</p>'
				},
				{
					title: "Лукойл",
					img: require('./assets/img/img_5.jpg'),
					description: '<p>ПАО «Лукойл» — российская нефтяная компания. Официальное название — ПАО «Нефтяная компания „Лукойл“»[3] Наименование компании происходит от первых букв названий городов нефтяников (Лангепас, Урай, Когалым) и слова «ойл» (от англ. oil — нефть)[4][5].</p><p>Вторая после «Газпрома» по объёмам выручки компания в России (по итогам 2014 года, по данным журнала «Эксперт»)[6]. До 2007 являлась крупнейшей по объёму добычи нефтяной компанией в России («Роснефть» опередила её после покупки активов «ЮКОСа»)[7]. По размеру доказанных запасов углеводородов «Лукойл», по собственным данным, по состоянию на 1 января 2011 года являлся третьей в мире частной нефтяной компанией (по запасам нефти — первой)[8].</p><p>Торговая марка «Лукойл» — один из двух российских брендов (наряду с «Балтикой»), вошедших в список 100 крупнейших мировых торговых марок, составленный в апреле 2007 года британской газетой Financial Times[9]. Впрочем, по итогам аналогичного рейтинга, составленного в апреле 2009 года, в сотню ведущих марок «Лукойл» уже не попал[10].</p><p>Штаб-квартира «Лукойл» находится в Москве, на Сретенском бульваре.</p><p>28 сентября 2018 года компания Лукойл возглавила рейтинг крупнейших частных компаний России по версии Forbes (Россия)[11].</p>'
				},
				{
					title: "Siemens",
					img: require('./assets/img/img_6.jpg'),
					description: '<p>Основателем фирмы является известный германский инженер, изобретатель, учёный, видный политический и общественный деятель Вернер фон Сименс. Он, совместно с Иоганном Гальске, создал фирму Telegraphen-Bauanstalt Siemens & Halske, официально приступившую к работе 12 октября 1847 и занимавшуюся кроме электротелеграфии широким кругом работ в области точной механики и оптики, а также созданием электромедицинских аппаратов. Финансовую поддержку компании оказал двоюродный брат Вернера, советник юстиции Иоганн Георг Сименс. Он внёс стартовый капитал в размере 6842 талера для оплаты расходов по найму помещения, жалования, текущих расходов в приобретении инструментов и необходимого материала.</p><p>В 1848—1849 годах фирма S&H построила первую в Германии телеграфную линию Берлин — Франкфурт-на-Майне. Первым сообщением, переданным по ней 28 марта 1849 года, стало известие о том, что Франкфуртское национальное собрание, заседавшее в церкви Святого Павла, предложило титул наследного кайзера Германии прусскому королю Фридриху Вильгельму IV. Одновременно с этой линией было начато строительство линий, связавших Берлин с Кёльном, Гамбургом, Бреслау и Штеттином.</p>'
				}
			],
			isMoreProjects: false
		}
	},
	computed: {
		moreProjectsBtnText: function(){
			if (this.isMoreProjects) {
				return 'скрыть'
			}
			return 'загрузить ещё'
		}
	},
	methods: {
		onSubmit(evt) {
			evt.preventDefault()
			alert(JSON.stringify(this.form))
		},
		openModalPolitics(){
			this.modalPolitics.modalShow = !this.modalPolitics.modalShow
		},
		openModal(content){
			this.modal.modalShow = !this.modal.modalShow
			this.modal.modalTitle = content.title
			this.modal.modalImg = content.img
			this.modal.modalContent = content.description
		}
	}
}
</script>
<style lang="scss">
	@import "./assets/sass/style.scss";
</style>
